h2zero/n-able-Arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC. All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2021 Ryan Powell. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA

menu.chip=Chip
menu.role=NimBLE Role
menu.cppDbgLvl=NimBLE debug log level
menu.lfclk=Low Frequency Clock


# nRF51822 variants
###################
Waveshare_BLE400.name=Waveshare BLE400

Waveshare_BLE400.upload.tool=openocd
Waveshare_BLE400.upload.target=nrf51
Waveshare_BLE400.upload.maximum_size=262144

Waveshare_BLE400.bootloader.tool=openocd

Waveshare_BLE400.build.mcu=cortex-m0
Waveshare_BLE400.build.f_cpu=16000000
Waveshare_BLE400.build.board=WAVESHARE_BLE400
Waveshare_BLE400.build.core=nRF5
Waveshare_BLE400.build.variant=Waveshare_BLE400
Waveshare_BLE400.build.variant_system_lib=
Waveshare_BLE400.build.float_flags=
Waveshare_BLE400.build.ldscript=nrf51_{build.chip}.ld
Waveshare_BLE400.build.lfclk_flags=-DUSE_LFXO
Waveshare_BLE400.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Waveshare_BLE400.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Waveshare_BLE400.menu.chip.xxaa.build.chip=xxaa
Waveshare_BLE400.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Waveshare_BLE400.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Waveshare_BLE400.menu.chip.xxac.build.chip=xxac
Waveshare_BLE400.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Waveshare_BLE400.menu.role.all=All
Waveshare_BLE400.menu.role.all.build.nimble_flags=
Waveshare_BLE400.menu.role.periph=Peripheral
Waveshare_BLE400.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Waveshare_BLE400.menu.role.adv=Advertiser
Waveshare_BLE400.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Waveshare_BLE400.menu.role.scan=Scanner
Waveshare_BLE400.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Waveshare_BLE400.menu.role.central=Client
Waveshare_BLE400.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Waveshare_BLE400.menu.cppDbgLvl.none=None
Waveshare_BLE400.menu.cppDbgLvl.none.build.cpp_debug=0
Waveshare_BLE400.menu.cppDbgLvl.error=Error
Waveshare_BLE400.menu.cppDbgLvl.error.build.cpp_debug=1
Waveshare_BLE400.menu.cppDbgLvl.warn=Warn
Waveshare_BLE400.menu.cppDbgLvl.warn.build.cpp_debug=2
Waveshare_BLE400.menu.cppDbgLvl.info=Info
Waveshare_BLE400.menu.cppDbgLvl.info.build.cpp_debug=3
Waveshare_BLE400.menu.cppDbgLvl.debug=Debug
Waveshare_BLE400.menu.cppDbgLvl.debug.build.cpp_debug=4


BluzDK.name=BluzDK

BluzDK.upload.tool=openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BLUZ_DK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_{build.chip}.ld
BluzDK.build.lfclk_flags=-DUSE_LFXO
BluzDK.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BluzDK.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BluzDK.menu.chip.xxaa.build.chip=xxaa
BluzDK.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BluzDK.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BluzDK.menu.chip.xxac.build.chip=xxac
BluzDK.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BluzDK.menu.role.all=All
BluzDK.menu.role.all.build.nimble_flags=
BluzDK.menu.role.periph=Peripheral
BluzDK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BluzDK.menu.role.adv=Advertiser
BluzDK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BluzDK.menu.role.scan=Scanner
BluzDK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BluzDK.menu.role.central=Client
BluzDK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BluzDK.menu.cppDbgLvl.none=None
BluzDK.menu.cppDbgLvl.none.build.cpp_debug=0
BluzDK.menu.cppDbgLvl.error=Error
BluzDK.menu.cppDbgLvl.error.build.cpp_debug=1
BluzDK.menu.cppDbgLvl.warn=Warn
BluzDK.menu.cppDbgLvl.warn.build.cpp_debug=2
BluzDK.menu.cppDbgLvl.info=Info
BluzDK.menu.cppDbgLvl.info.build.cpp_debug=3
BluzDK.menu.cppDbgLvl.debug=Debug
BluzDK.menu.cppDbgLvl.debug.build.cpp_debug=4


CalliopeMini.name=Calliope mini

CalliopeMini.upload.tool=openocd
CalliopeMini.upload.protocol=cmsis-dap
CalliopeMini.upload.target=nrf51
CalliopeMini.upload.maximum_size=262144

CalliopeMini.bootloader.tool=openocd

CalliopeMini.build.mcu=cortex-m0
CalliopeMini.build.f_cpu=16000000
CalliopeMini.build.board=CALLIOPE_MINI
CalliopeMini.build.core=nRF5
CalliopeMini.build.variant=CalliopeMini
CalliopeMini.build.variant_system_lib=
CalliopeMini.build.float_flags=
CalliopeMini.build.ldscript=nrf51_{build.chip}.ld
CalliopeMini.build.lfclk_flags=-DUSE_LFXO
CalliopeMini.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

CalliopeMini.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
CalliopeMini.menu.chip.xxaa.build.chip=xxaa
CalliopeMini.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
CalliopeMini.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
CalliopeMini.menu.chip.xxac.build.chip=xxac
CalliopeMini.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

CalliopeMini.menu.role.all=All
CalliopeMini.menu.role.all.build.nimble_flags=
CalliopeMini.menu.role.periph=Peripheral
CalliopeMini.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
CalliopeMini.menu.role.adv=Advertiser
CalliopeMini.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
CalliopeMini.menu.role.scan=Scanner
CalliopeMini.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
CalliopeMini.menu.role.central=Client
CalliopeMini.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

CalliopeMini.menu.cppDbgLvl.none=None
CalliopeMini.menu.cppDbgLvl.none.build.cpp_debug=0
CalliopeMini.menu.cppDbgLvl.error=Error
CalliopeMini.menu.cppDbgLvl.error.build.cpp_debug=1
CalliopeMini.menu.cppDbgLvl.warn=Warn
CalliopeMini.menu.cppDbgLvl.warn.build.cpp_debug=2
CalliopeMini.menu.cppDbgLvl.info=Info
CalliopeMini.menu.cppDbgLvl.info.build.cpp_debug=3
CalliopeMini.menu.cppDbgLvl.debug=Debug
CalliopeMini.menu.cppDbgLvl.debug.build.cpp_debug=4


ng_beacon.name=ng-beacon

ng_beacon.upload.tool=openocd
ng_beacon.upload.target=nrf51
ng_beacon.upload.maximum_size=262144

ng_beacon.bootloader.tool=openocd

