h2zero/n-able-Arduino/boards.txt
ng_beacon.build.mcu=cortex-m0
ng_beacon.build.f_cpu=16000000
ng_beacon.build.board=NG_BEACON
ng_beacon.build.core=nRF5
ng_beacon.build.variant=ng_beacon
ng_beacon.build.variant_system_lib=
ng_beacon.build.float_flags=
ng_beacon.build.ldscript=nrf51_{build.chip}.ld
ng_beacon.build.lfclk_flags=-DUSE_LFXO
ng_beacon.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

ng_beacon.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
ng_beacon.menu.chip.xxaa.build.chip=xxaa
ng_beacon.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
ng_beacon.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
ng_beacon.menu.chip.xxac.build.chip=xxac
ng_beacon.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

ng_beacon.menu.role.all=All
ng_beacon.menu.role.all.build.nimble_flags=
ng_beacon.menu.role.periph=Peripheral
ng_beacon.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
ng_beacon.menu.role.adv=Advertiser
ng_beacon.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
ng_beacon.menu.role.scan=Scanner
ng_beacon.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
ng_beacon.menu.role.central=Client
ng_beacon.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

ng_beacon.menu.cppDbgLvl.none=None
ng_beacon.menu.cppDbgLvl.none.build.cpp_debug=0
ng_beacon.menu.cppDbgLvl.error=Error
ng_beacon.menu.cppDbgLvl.error.build.cpp_debug=1
ng_beacon.menu.cppDbgLvl.warn=Warn
ng_beacon.menu.cppDbgLvl.warn.build.cpp_debug=2
ng_beacon.menu.cppDbgLvl.info=Info
ng_beacon.menu.cppDbgLvl.info.build.cpp_debug=3
ng_beacon.menu.cppDbgLvl.debug=Debug
ng_beacon.menu.cppDbgLvl.debug.build.cpp_debug=4


Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=openocd
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.maximum_size=262144

Beacon_PCA20006.bootloader.tool=openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BEACON_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=Beacon_PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_{build.chip}.ld
Beacon_PCA20006.build.lfclk_flags=-DUSE_LFXO
Beacon_PCA20006.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Beacon_PCA20006.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Beacon_PCA20006.menu.chip.xxaa.build.chip=xxaa
Beacon_PCA20006.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Beacon_PCA20006.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Beacon_PCA20006.menu.chip.xxac.build.chip=xxac
Beacon_PCA20006.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Beacon_PCA20006.menu.cppDbgLvl.none=None
Beacon_PCA20006.menu.cppDbgLvl.none.build.cpp_debug=0
Beacon_PCA20006.menu.cppDbgLvl.error=Error
Beacon_PCA20006.menu.cppDbgLvl.error.build.cpp_debug=1
Beacon_PCA20006.menu.cppDbgLvl.warn=Warn
Beacon_PCA20006.menu.cppDbgLvl.warn.build.cpp_debug=2
Beacon_PCA20006.menu.cppDbgLvl.info=Info
Beacon_PCA20006.menu.cppDbgLvl.info.build.cpp_debug=3
Beacon_PCA20006.menu.cppDbgLvl.debug=Debug
Beacon_PCA20006.menu.cppDbgLvl.debug.build.cpp_debug=4


BBCmicrobit.name=BBC micro:bit

BBCmicrobit.upload.tool=openocd
BBCmicrobit.upload.target=nrf51
BBCmicrobit.upload.maximum_size=262144

BBCmicrobit.bootloader.tool=openocd

BBCmicrobit.build.mcu=cortex-m0
BBCmicrobit.build.f_cpu=16000000
BBCmicrobit.build.board=BBC_MICROBIT
BBCmicrobit.build.core=nRF5
BBCmicrobit.build.variant=BBCmicrobit
BBCmicrobit.build.variant_system_lib=
BBCmicrobit.build.float_flags=
BBCmicrobit.build.ldscript=nrf51_{build.chip}.ld
BBCmicrobit.build.lfclk_flags=-DUSE_LFXO
BBCmicrobit.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BBCmicrobit.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BBCmicrobit.menu.chip.xxaa.build.chip=xxaa
BBCmicrobit.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BBCmicrobit.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BBCmicrobit.menu.chip.xxac.build.chip=xxac
BBCmicrobit.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BBCmicrobit.menu.role.all=All
BBCmicrobit.menu.role.all.build.nimble_flags=
BBCmicrobit.menu.role.periph=Peripheral
BBCmicrobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BBCmicrobit.menu.role.adv=Advertiser
BBCmicrobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BBCmicrobit.menu.role.scan=Scanner
BBCmicrobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BBCmicrobit.menu.role.central=Client
BBCmicrobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BBCmicrobit.menu.cppDbgLvl.none=None
BBCmicrobit.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobit.menu.cppDbgLvl.error=Error
BBCmicrobit.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobit.menu.cppDbgLvl.warn=Warn
BBCmicrobit.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobit.menu.cppDbgLvl.info=Info
BBCmicrobit.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobit.menu.cppDbgLvl.debug=Debug
BBCmicrobit.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF51DK.name=Nordic Semiconductor nRF51 DK

nRF51DK.upload.tool=openocd
nRF51DK.upload.target=nrf51
nRF51DK.upload.maximum_size=262144

nRF51DK.bootloader.tool=openocd

nRF51DK.build.mcu=cortex-m0
nRF51DK.build.f_cpu=16000000
nRF51DK.build.board=NRF51_DK
nRF51DK.build.core=nRF5
nRF51DK.build.variant=nRF51DK
nRF51DK.build.variant_system_lib=
nRF51DK.build.float_flags=
nRF51DK.build.ldscript=nrf51_{build.chip}.ld
nRF51DK.build.lfclk_flags=-DUSE_LFXO
nRF51DK.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF51DK.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
nRF51DK.menu.chip.xxaa.build.chip=xxaa
nRF51DK.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
nRF51DK.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
nRF51DK.menu.chip.xxac.build.chip=xxac
nRF51DK.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

nRF51DK.menu.role.all=All
nRF51DK.menu.role.all.build.nimble_flags=
nRF51DK.menu.role.periph=Peripheral
nRF51DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51DK.menu.role.adv=Advertiser
nRF51DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51DK.menu.role.scan=Scanner
nRF51DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51DK.menu.role.central=Client
nRF51DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51DK.menu.cppDbgLvl.none=None
nRF51DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51DK.menu.cppDbgLvl.error=Error
nRF51DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51DK.menu.cppDbgLvl.warn=Warn
nRF51DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51DK.menu.cppDbgLvl.info=Info
nRF51DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51DK.menu.cppDbgLvl.debug=Debug
nRF51DK.menu.cppDbgLvl.debug.build.cpp_debug=4


