h2zero/n-able-Arduino/boards.txt
nRF51Dongle.name=Nordic nRF51 Dongle

nRF51Dongle.upload.tool=openocd
nRF51Dongle.upload.target=nrf51
nRF51Dongle.upload.maximum_size=262144

nRF51Dongle.bootloader.tool=openocd

nRF51Dongle.build.mcu=cortex-m0
nRF51Dongle.build.f_cpu=16000000
nRF51Dongle.build.board=NRF51_DONGLE
nRF51Dongle.build.core=nRF5
nRF51Dongle.build.variant=nRF51_Dongle
nRF51Dongle.build.variant_system_lib=
nRF51Dongle.build.float_flags=
nRF51Dongle.build.ldscript=nrf51_{build.chip}.ld
nRF51Dongle.build.lfclk_flags=-DUSE_LFXO
nRF51Dongle.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF51Dongle.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
nRF51Dongle.menu.chip.xxaa.build.chip=xxaa
nRF51Dongle.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
nRF51Dongle.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
nRF51Dongle.menu.chip.xxac.build.chip=xxac
nRF51Dongle.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

nRF51Dongle.menu.role.all=All
nRF51Dongle.menu.role.all.build.nimble_flags=
nRF51Dongle.menu.role.periph=Peripheral
nRF51Dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51Dongle.menu.role.adv=Advertiser
nRF51Dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51Dongle.menu.role.scan=Scanner
nRF51Dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51Dongle.menu.role.central=Client
nRF51Dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51Dongle.menu.cppDbgLvl.none=None
nRF51Dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51Dongle.menu.cppDbgLvl.error=Error
nRF51Dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51Dongle.menu.cppDbgLvl.warn=Warn
nRF51Dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51Dongle.menu.cppDbgLvl.info=Info
nRF51Dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51Dongle.menu.cppDbgLvl.debug=Debug
nRF51Dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


OSHChip.name=OSHChip

OSHChip.upload.tool=openocd
OSHChip.upload.target=nrf51
OSHChip.upload.maximum_size=262144

OSHChip.bootloader.tool=openocd

OSHChip.build.mcu=cortex-m0
OSHChip.build.f_cpu=16000000
OSHChip.build.board=OSHCHIP
OSHChip.build.core=nRF5
OSHChip.build.variant=OSHChip
OSHChip.build.variant_system_lib=
OSHChip.build.float_flags=
OSHChip.build.ldscript=nrf51_{build.chip}.ld
OSHChip.build.lfclk_flags=-DUSE_LFXO
OSHChip.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

OSHChip.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
OSHChip.menu.chip.xxaa.build.chip=xxaa
OSHChip.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
OSHChip.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
OSHChip.menu.chip.xxac.build.chip=xxac
OSHChip.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

OSHChip.menu.role.all=All
OSHChip.menu.role.all.build.nimble_flags=
OSHChip.menu.role.periph=Peripheral
OSHChip.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
OSHChip.menu.role.adv=Advertiser
OSHChip.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
OSHChip.menu.role.scan=Scanner
OSHChip.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
OSHChip.menu.role.central=Client
OSHChip.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

OSHChip.menu.cppDbgLvl.none=None
OSHChip.menu.cppDbgLvl.none.build.cpp_debug=0
OSHChip.menu.cppDbgLvl.error=Error
OSHChip.menu.cppDbgLvl.error.build.cpp_debug=1
OSHChip.menu.cppDbgLvl.warn=Warn
OSHChip.menu.cppDbgLvl.warn.build.cpp_debug=2
OSHChip.menu.cppDbgLvl.info=Info
OSHChip.menu.cppDbgLvl.info.build.cpp_debug=3
OSHChip.menu.cppDbgLvl.debug=Debug
OSHChip.menu.cppDbgLvl.debug.build.cpp_debug=4


RedBearLab_nRF51822.name=RedBearLab nRF51822

RedBearLab_nRF51822.upload.tool=openocd
RedBearLab_nRF51822.upload.target=nrf51
RedBearLab_nRF51822.upload.maximum_size=262144

RedBearLab_nRF51822.bootloader.tool=openocd

RedBearLab_nRF51822.build.mcu=cortex-m0
RedBearLab_nRF51822.build.f_cpu=16000000
RedBearLab_nRF51822.build.board=REDBEARLAB_NRF51822
RedBearLab_nRF51822.build.core=nRF5
RedBearLab_nRF51822.build.variant=RedBearLab_nRF51822
RedBearLab_nRF51822.build.variant_system_lib=
RedBearLab_nRF51822.build.float_flags=
RedBearLab_nRF51822.build.ldscript=nrf51_{build.chip}.ld
RedBearLab_nRF51822.build.lfclk_flags=-DUSE_LFXO
RedBearLab_nRF51822.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

RedBearLab_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
RedBearLab_nRF51822.menu.chip.xxaa.build.chip=xxaa
RedBearLab_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
RedBearLab_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
RedBearLab_nRF51822.menu.chip.xxac.build.chip=xxac
RedBearLab_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

RedBearLab_nRF51822.menu.role.all=All
RedBearLab_nRF51822.menu.role.all.build.nimble_flags=
RedBearLab_nRF51822.menu.role.periph=Peripheral
RedBearLab_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
RedBearLab_nRF51822.menu.role.adv=Advertiser
RedBearLab_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
RedBearLab_nRF51822.menu.role.scan=Scanner
RedBearLab_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
RedBearLab_nRF51822.menu.role.central=Client
RedBearLab_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

