h2zero/n-able-Arduino/boards.txt
RedBearLab_nRF51822.menu.cppDbgLvl.none=None
RedBearLab_nRF51822.menu.cppDbgLvl.none.build.cpp_debug=0
RedBearLab_nRF51822.menu.cppDbgLvl.error=Error
RedBearLab_nRF51822.menu.cppDbgLvl.error.build.cpp_debug=1
RedBearLab_nRF51822.menu.cppDbgLvl.warn=Warn
RedBearLab_nRF51822.menu.cppDbgLvl.warn.build.cpp_debug=2
RedBearLab_nRF51822.menu.cppDbgLvl.info=Info
RedBearLab_nRF51822.menu.cppDbgLvl.info.build.cpp_debug=3
RedBearLab_nRF51822.menu.cppDbgLvl.debug=Debug
RedBearLab_nRF51822.menu.cppDbgLvl.debug.build.cpp_debug=4


BLENano.name=RedBearLab BLE Nano

BLENano.upload.tool=openocd
BLENano.upload.target=nrf51
BLENano.upload.maximum_size=262144

BLENano.bootloader.tool=openocd

BLENano.build.mcu=cortex-m0
BLENano.build.f_cpu=16000000
BLENano.build.board=BLE_NANO
BLENano.build.core=nRF5
BLENano.build.variant=BLENano
BLENano.build.variant_system_lib=
BLENano.build.float_flags=
BLENano.build.ldscript=nrf51_{build.chip}.ld
BLENano.build.lfclk_flags=-DUSE_LFXO
BLENano.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BLENano.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BLENano.menu.chip.xxaa.build.chip=xxaa
BLENano.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BLENano.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BLENano.menu.chip.xxac.build.chip=xxac
BLENano.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BLENano.menu.role.all=All
BLENano.menu.role.all.build.nimble_flags=
BLENano.menu.role.periph=Peripheral
BLENano.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano.menu.role.adv=Advertiser
BLENano.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano.menu.role.scan=Scanner
BLENano.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano.menu.role.central=Client
BLENano.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano.menu.cppDbgLvl.none=None
BLENano.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano.menu.cppDbgLvl.error=Error
BLENano.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano.menu.cppDbgLvl.warn=Warn
BLENano.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano.menu.cppDbgLvl.info=Info
BLENano.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano.menu.cppDbgLvl.debug=Debug
BLENano.menu.cppDbgLvl.debug.build.cpp_debug=4


TinyBLE.name=TinyBLE

TinyBLE.upload.tool=openocd
TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144

TinyBLE.bootloader.tool=openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_{build.chip}.ld
TinyBLE.build.lfclk_flags=-DUSE_LFXO
TinyBLE.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

TinyBLE.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
TinyBLE.menu.chip.xxaa.build.chip=xxaa
TinyBLE.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
TinyBLE.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
TinyBLE.menu.chip.xxac.build.chip=xxac
TinyBLE.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

TinyBLE.menu.role.all=All
TinyBLE.menu.role.all.build.nimble_flags=
TinyBLE.menu.role.periph=Peripheral
TinyBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
TinyBLE.menu.role.adv=Advertiser
TinyBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
TinyBLE.menu.role.scan=Scanner
TinyBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
TinyBLE.menu.role.central=Client
TinyBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

TinyBLE.menu.cppDbgLvl.none=None
TinyBLE.menu.cppDbgLvl.none.build.cpp_debug=0
TinyBLE.menu.cppDbgLvl.error=Error
TinyBLE.menu.cppDbgLvl.error.build.cpp_debug=1
TinyBLE.menu.cppDbgLvl.warn=Warn
TinyBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
TinyBLE.menu.cppDbgLvl.info=Info
TinyBLE.menu.cppDbgLvl.info.build.cpp_debug=3
TinyBLE.menu.cppDbgLvl.debug=Debug
TinyBLE.menu.cppDbgLvl.debug.build.cpp_debug=4


Sinobit.name=Sino:bit

Sinobit.upload.tool=openocd
Sinobit.upload.target=nrf51
Sinobit.upload.maximum_size=262144

Sinobit.bootloader.tool=openocd

Sinobit.build.mcu=cortex-m0
Sinobit.build.f_cpu=16000000
Sinobit.build.board=SINOBIT
Sinobit.build.core=nRF5
Sinobit.build.variant=Sinobit
Sinobit.build.variant_system_lib=
Sinobit.build.float_flags=
Sinobit.build.ldscript=nrf51_{build.chip}.ld
Sinobit.build.lfclk_flags=-DUSE_LFXO
Sinobit.build.extra_flags=-DNRF51 -D__STACK_SIZE=400 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Sinobit.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
Sinobit.menu.chip.xxaa.build.chip=xxaa
Sinobit.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
Sinobit.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
Sinobit.menu.chip.xxac.build.chip=xxac
Sinobit.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

Sinobit.menu.role.all=All
Sinobit.menu.role.all.build.nimble_flags=
Sinobit.menu.role.periph=Peripheral
Sinobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Sinobit.menu.role.adv=Advertiser
Sinobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Sinobit.menu.role.scan=Scanner
Sinobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Sinobit.menu.role.central=Client
Sinobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Sinobit.menu.cppDbgLvl.none=None
Sinobit.menu.cppDbgLvl.none.build.cpp_debug=0
Sinobit.menu.cppDbgLvl.error=Error
Sinobit.menu.cppDbgLvl.error.build.cpp_debug=1
Sinobit.menu.cppDbgLvl.warn=Warn
Sinobit.menu.cppDbgLvl.warn.build.cpp_debug=2
Sinobit.menu.cppDbgLvl.info=Info
Sinobit.menu.cppDbgLvl.info.build.cpp_debug=3
Sinobit.menu.cppDbgLvl.debug=Debug
Sinobit.menu.cppDbgLvl.debug.build.cpp_debug=4


# nRF52832 variants
###################

Generic_nRF52832.name=Generic nRF52

Generic_nRF52832.upload.tool=openocd
Generic_nRF52832.upload.target=nrf52
Generic_nRF52832.upload.maximum_size=524288

Generic_nRF52832.bootloader.tool=openocd

Generic_nRF52832.build.mcu=cortex-m4
Generic_nRF52832.build.f_cpu=64000000
Generic_nRF52832.build.board=GENERIC
Generic_nRF52832.build.core=nRF5
Generic_nRF52832.build.variant=Generic
Generic_nRF52832.build.variant_system_lib=
Generic_nRF52832.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52832.build.ldscript=nrf52_xxaa.ld
Generic_nRF52832.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF52832.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52832.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52832.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52832.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52832.menu.lfclk.lfsynt=Synthesized
Generic_nRF52832.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52832.menu.role.all=All
Generic_nRF52832.menu.role.all.build.nimble_flags=
Generic_nRF52832.menu.role.periph=Peripheral
Generic_nRF52832.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52832.menu.role.adv=Advertiser
Generic_nRF52832.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52832.menu.role.scan=Scanner
Generic_nRF52832.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52832.menu.role.central=Client
Generic_nRF52832.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52832.menu.cppDbgLvl.none=None
Generic_nRF52832.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52832.menu.cppDbgLvl.error=Error
Generic_nRF52832.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52832.menu.cppDbgLvl.warn=Warn
Generic_nRF52832.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52832.menu.cppDbgLvl.info=Info
Generic_nRF52832.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52832.menu.cppDbgLvl.debug=Debug
Generic_nRF52832.menu.cppDbgLvl.debug.build.cpp_debug=4



