h2zero/n-able-Arduino/boards.txt
nRF52DK.name=Nordic nRF52832DK (PCA10040)

nRF52DK.vid.0=0x1366
nRF52DK.pid.0=0x1015

nRF52DK.upload.tool=openocd
nRF52DK.upload.protocol=jlink
nRF52DK.upload.target=nrf52
nRF52DK.upload.maximum_size=524288
nRF52DK.upload.setup_command=transport select swd;
nRF52DK.upload.use_1200bps_touch=false
nRF52DK.upload.wait_for_upload_port=false
nRF52DK.upload.native_usb=false

nRF52DK.bootloader.tool=openocd

nRF52DK.build.mcu=cortex-m4
nRF52DK.build.f_cpu=64000000
nRF52DK.build.board=NRF52_DK
nRF52DK.build.core=nRF5
nRF52DK.build.variant=nRF52832_DK
nRF52DK.build.variant_system_lib=
nRF52DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52DK.build.ldscript=nrf52_xxaa.ld
nRF52DK.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52DK.build.lfclk_flags=-DUSE_LFXO

nRF52DK.menu.role.all=All
nRF52DK.menu.role.all.build.nimble_flags=
nRF52DK.menu.role.periph=Peripheral
nRF52DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52DK.menu.role.adv=Advertiser
nRF52DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52DK.menu.role.scan=Scanner
nRF52DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52DK.menu.role.central=Client
nRF52DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52DK.menu.cppDbgLvl.none=None
nRF52DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52DK.menu.cppDbgLvl.error=Error
nRF52DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52DK.menu.cppDbgLvl.warn=Warn
nRF52DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52DK.menu.cppDbgLvl.info=Info
nRF52DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52DK.menu.cppDbgLvl.debug=Debug
nRF52DK.menu.cppDbgLvl.debug.build.cpp_debug=4



BT5032A-TB.name=Ebyte BT5032A-TB

BT5032A-TB.upload.tool=openocd
BT5032A-TB.upload.target=nrf52
BT5032A-TB.upload.maximum_size=524288

BT5032A-TB.bootloader.tool=openocd

BT5032A-TB.build.mcu=cortex-m4
BT5032A-TB.build.f_cpu=64000000
BT5032A-TB.build.board=BT5032A_TB
BT5032A-TB.build.core=nRF5
BT5032A-TB.build.variant=BT5032A_TB
BT5032A-TB.build.variant_system_lib=
BT5032A-TB.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5032A-TB.build.ldscript=nrf52832_xxaa.ld
BT5032A-TB.build.lfclk_flags=-DUSE_LFXO
BT5032A-TB.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BT5032A-TB.menu.role.all=All
BT5032A-TB.menu.role.all.build.nimble_flags=
BT5032A-TB.menu.role.periph=Peripheral
BT5032A-TB.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5032A-TB.menu.role.adv=Advertiser
BT5032A-TB.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5032A-TB.menu.role.scan=Scanner
BT5032A-TB.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5032A-TB.menu.role.central=Client
BT5032A-TB.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5032A-TB.menu.cppDbgLvl.none=None
BT5032A-TB.menu.cppDbgLvl.none.build.cpp_debug=0
BT5032A-TB.menu.cppDbgLvl.error=Error
BT5032A-TB.menu.cppDbgLvl.error.build.cpp_debug=1
BT5032A-TB.menu.cppDbgLvl.warn=Warn
BT5032A-TB.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5032A-TB.menu.cppDbgLvl.info=Info
BT5032A-TB.menu.cppDbgLvl.info.build.cpp_debug=3
BT5032A-TB.menu.cppDbgLvl.debug=Debug
BT5032A-TB.menu.cppDbgLvl.debug.build.cpp_debug=4



bluey.name=Electronut labs bluey

bluey.upload.tool=openocd
bluey.upload.target=nrf52
bluey.upload.maximum_size=524288

bluey.bootloader.tool=openocd

bluey.build.mcu=cortex-m4
bluey.build.f_cpu=64000000
bluey.build.board=ELECTRONUT_BLUEY
bluey.build.core=nRF5
bluey.build.variant=bluey
bluey.build.variant_system_lib=
bluey.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
bluey.build.ldscript=nrf52_xxaa.ld
bluey.build.lfclk_flags=-DUSE_LFXO
bluey.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

bluey.menu.role.all=All
bluey.menu.role.all.build.nimble_flags=
bluey.menu.role.periph=Peripheral
bluey.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
bluey.menu.role.adv=Advertiser
bluey.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
bluey.menu.role.scan=Scanner
bluey.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
bluey.menu.role.central=Client
bluey.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

bluey.menu.cppDbgLvl.none=None
bluey.menu.cppDbgLvl.none.build.cpp_debug=0
bluey.menu.cppDbgLvl.error=Error
bluey.menu.cppDbgLvl.error.build.cpp_debug=1
bluey.menu.cppDbgLvl.warn=Warn
bluey.menu.cppDbgLvl.warn.build.cpp_debug=2
bluey.menu.cppDbgLvl.info=Info
bluey.menu.cppDbgLvl.info.build.cpp_debug=3
bluey.menu.cppDbgLvl.debug=Debug
bluey.menu.cppDbgLvl.debug.build.cpp_debug=4



hackaBLE.name=Electronut labs hackaBLE

hackaBLE.upload.tool=openocd
hackaBLE.upload.target=nrf52
hackaBLE.upload.maximum_size=524288

hackaBLE.bootloader.tool=openocd

hackaBLE.build.mcu=cortex-m4
hackaBLE.build.f_cpu=64000000
hackaBLE.build.board=ELECTRONUT_HACKABLE
hackaBLE.build.core=nRF5
hackaBLE.build.variant=hackaBLE
hackaBLE.build.variant_system_lib=
hackaBLE.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE.build.ldscript=nrf52_xxaa.ld
hackaBLE.build.lfclk_flags=-DUSE_LFXO
hackaBLE.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

