h2zero/n-able-Arduino/boards.txt
hackaBLE.menu.role.all=All
hackaBLE.menu.role.all.build.nimble_flags=
hackaBLE.menu.role.periph=Peripheral
hackaBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE.menu.role.adv=Advertiser
hackaBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE.menu.role.scan=Scanner
hackaBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE.menu.role.central=Client
hackaBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

hackaBLE.menu.cppDbgLvl.none=None
hackaBLE.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE.menu.cppDbgLvl.error=Error
hackaBLE.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE.menu.cppDbgLvl.warn=Warn
hackaBLE.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE.menu.cppDbgLvl.info=Info
hackaBLE.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE.menu.cppDbgLvl.debug=Debug
hackaBLE.menu.cppDbgLvl.debug.build.cpp_debug=4



hackaBLE_v2.name=Electronut labs hackaBLE_v2

hackaBLE_v2.upload.tool=openocd
hackaBLE_v2.upload.target=nrf52
hackaBLE_v2.upload.maximum_size=524288

hackaBLE_v2.bootloader.tool=openocd

hackaBLE_v2.build.mcu=cortex-m4
hackaBLE_v2.build.f_cpu=64000000
hackaBLE_v2.build.board=ELECTRONUT_HACKABLE_V2
hackaBLE_v2.build.core=nRF5
hackaBLE_v2.build.variant=hackaBLE_v2
hackaBLE_v2.build.variant_system_lib=
hackaBLE_v2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
hackaBLE_v2.build.ldscript=nrf52_xxaa.ld
hackaBLE_v2.build.lfclk_flags=-DUSE_LFXO
hackaBLE_v2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

hackaBLE_v2.menu.role.all=All
hackaBLE_v2.menu.role.all.build.nimble_flags=
hackaBLE_v2.menu.role.periph=Peripheral
hackaBLE_v2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
hackaBLE_v2.menu.role.adv=Advertiser
hackaBLE_v2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
hackaBLE_v2.menu.role.scan=Scanner
hackaBLE_v2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
hackaBLE_v2.menu.role.central=Client
hackaBLE_v2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

hackaBLE_v2.menu.cppDbgLvl.none=None
hackaBLE_v2.menu.cppDbgLvl.none.build.cpp_debug=0
hackaBLE_v2.menu.cppDbgLvl.error=Error
hackaBLE_v2.menu.cppDbgLvl.error.build.cpp_debug=1
hackaBLE_v2.menu.cppDbgLvl.warn=Warn
hackaBLE_v2.menu.cppDbgLvl.warn.build.cpp_debug=2
hackaBLE_v2.menu.cppDbgLvl.info=Info
hackaBLE_v2.menu.cppDbgLvl.info.build.cpp_debug=3
hackaBLE_v2.menu.cppDbgLvl.debug=Debug
hackaBLE_v2.menu.cppDbgLvl.debug.build.cpp_debug=4



Blend2.name=RedBear BLE Nano 2

Blend2.upload.tool=openocd
Blend2.upload.target=nrf52
Blend2.upload.maximum_size=913408

Blend2.bootloader.tool=openocd

Blend2.build.mcu=cortex-m4
Blend2.build.f_cpu=64000000
Blend2.build.board=RB_BLEND_2
Blend2.build.core=nRF5
Blend2.build.variant=RedBear_Blend2
Blend2.build.variant_system_lib=
Blend2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Blend2.build.ldscript=nrf52_xxaa.ld
Blend2.build.lfclk_flags=-DUSE_LFXO
Blend2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Blend2.menu.role.all=All
Blend2.menu.role.all.build.nimble_flags=
Blend2.menu.role.periph=Peripheral
Blend2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Blend2.menu.role.adv=Advertiser
Blend2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Blend2.menu.role.scan=Scanner
Blend2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Blend2.menu.role.central=Client
Blend2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Blend2.menu.cppDbgLvl.none=None
Blend2.menu.cppDbgLvl.none.build.cpp_debug=0
Blend2.menu.cppDbgLvl.error=Error
Blend2.menu.cppDbgLvl.error.build.cpp_debug=1
Blend2.menu.cppDbgLvl.warn=Warn
Blend2.menu.cppDbgLvl.warn.build.cpp_debug=2
Blend2.menu.cppDbgLvl.info=Info
Blend2.menu.cppDbgLvl.info.build.cpp_debug=3
Blend2.menu.cppDbgLvl.debug=Debug
Blend2.menu.cppDbgLvl.debug.build.cpp_debug=4



BLENano2.name=RedBear BLE Nano 2

BLENano2.upload.tool=openocd
BLENano2.upload.target=nrf52
BLENano2.upload.maximum_size=913408

BLENano2.bootloader.tool=openocd

BLENano2.build.mcu=cortex-m4
BLENano2.build.f_cpu=64000000
BLENano2.build.board=RB_BLE_NANO_2
BLENano2.build.core=nRF5
BLENano2.build.variant=RedBear_BLENano2
BLENano2.build.variant_system_lib=
BLENano2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BLENano2.build.ldscript=nrf52_xxaa.ld
BLENano2.build.lfclk_flags=-DUSE_LFXO
BLENano2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BLENano2.menu.role.all=All
BLENano2.menu.role.all.build.nimble_flags=
BLENano2.menu.role.periph=Peripheral
BLENano2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano2.menu.role.adv=Advertiser
BLENano2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano2.menu.role.scan=Scanner
BLENano2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano2.menu.role.central=Client
BLENano2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano2.menu.cppDbgLvl.none=None
BLENano2.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano2.menu.cppDbgLvl.error=Error
BLENano2.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano2.menu.cppDbgLvl.warn=Warn
BLENano2.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano2.menu.cppDbgLvl.info=Info
BLENano2.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano2.menu.cppDbgLvl.debug=Debug
BLENano2.menu.cppDbgLvl.debug.build.cpp_debug=4



