h2zero/n-able-Arduino/boards.txt
# nRF52840 variants
###################

nRF52840_DK.name=Nordic nRF52840 DK

nRF52840_DK.upload.tool=nrfutil
nRF52840_DK.upload.target=nrf52
nRF52840_DK.upload.maximum_size=1048576

nRF52840_DK.bootloader.tool=openocd

nRF52840_DK.build.mcu=cortex-m4
nRF52840_DK.build.f_cpu=64000000
nRF52840_DK.build.board=NRF52840_DK
nRF52840_DK.build.core=nRF5
nRF52840_DK.build.variant=nRF52840_DK
nRF52840_DK.build.variant_system_lib=
nRF52840_DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_DK.build.ldscript=nRF52840_DK.ld
nRF52840_DK.build.lfclk_flags=-DUSE_LFXO
nRF52840_DK.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -D__STACK_SIZE=2048 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52840_DK.menu.role.all=All
nRF52840_DK.menu.role.all.build.nimble_flags=
nRF52840_DK.menu.role.periph=Peripheral
nRF52840_DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_DK.menu.role.adv=Advertiser
nRF52840_DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_DK.menu.role.scan=Scanner
nRF52840_DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_DK.menu.role.central=Client
nRF52840_DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_DK.menu.cppDbgLvl.none=None
nRF52840_DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_DK.menu.cppDbgLvl.error=Error
nRF52840_DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_DK.menu.cppDbgLvl.warn=Warn
nRF52840_DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_DK.menu.cppDbgLvl.info=Info
nRF52840_DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_DK.menu.cppDbgLvl.debug=Debug
nRF52840_DK.menu.cppDbgLvl.debug.build.cpp_debug=4



nRF52840_dongle.name=nRF52840_dongle

nRF52840_dongle.upload.tool=nrfutil
nRF52840_dongle.upload.target=nrf52
nRF52840_dongle.upload.maximum_size=913408

nRF52840_dongle.bootloader.tool=openocd

nRF52840_dongle.build.mcu=cortex-m4
nRF52840_dongle.build.f_cpu=64000000
nRF52840_dongle.build.board=NRF52840_DONGLE
nRF52840_dongle.build.core=nRF5
nRF52840_dongle.build.variant=nRF52840_Dongle
nRF52840_dongle.build.variant_system_lib=
nRF52840_dongle.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_dongle.build.ldscript=nrf52840_dongle.ld
nRF52840_dongle.build.vid=0x1915
nRF52840_dongle.build.pid=0x521B
nRF52840_dongle.build.lfclk_flags=-DUSE_LFXO
nRF52840_dongle.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -DUSB_CDC_DEFAULT_SERIAL -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
nRF52840_dongle.build.dfu_pattern={nrfutil.dfu_pattern}

nRF52840_dongle.menu.role.all=All
nRF52840_dongle.menu.role.all.build.nimble_flags=
nRF52840_dongle.menu.role.periph=Peripheral
nRF52840_dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_dongle.menu.role.adv=Advertiser
nRF52840_dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_dongle.menu.role.scan=Scanner
nRF52840_dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_dongle.menu.role.central=Client
nRF52840_dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_dongle.menu.cppDbgLvl.none=None
nRF52840_dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_dongle.menu.cppDbgLvl.error=Error
nRF52840_dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_dongle.menu.cppDbgLvl.warn=Warn
nRF52840_dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_dongle.menu.cppDbgLvl.info=Info
nRF52840_dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_dongle.menu.cppDbgLvl.debug=Debug
nRF52840_dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


BT5040.name=E104-BT5040

BT5040.upload.tool=nrfutil
BT5040.upload.target=nrf52
BT5040.upload.maximum_size=913408

BT5040.bootloader.tool=openocd

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=nRF52840_Dongle
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x1915
BT5040.build.pid=0x521B
BT5040.build.lfclk_flags=-DUSE_LFXO
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_TINYUSB -DUSB_CDC_DEFAULT_SERIAL -D__STACK_SIZE=2048 -DUSB_VID={build.vid} -DUSB_PID={build.pid} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
BT5040.build.dfu_pattern={nrfutil.dfu_pattern}

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4



